# GetSlabStyle

## Description
Gets the Slab Style of a slab.

```pascal
FUNCTION GetSlabStyle(slab : HANDLE): LONGINT;
```

```python
def vs.GetSlabStyle(slab):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|slab|HANDLE|The slab.|

## See Also
VS Functions:
SetSlabStyle

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural